In [1]:
import numpy as np
import pandas as pd

In [2]:
# Reading the two different files.
a = pd.read_csv('a.csv')
b = pd.read_csv('b.csv')

In [3]:
a

    A   B
0  10  20
1  30  40

In [4]:
b

    A   C
0  10  20
1  30  40

In [5]:
b.merge(a)

    A   C   B
0  10  20  20
1  30  40  40

In [6]:
a.merge(b)

    A   B   C
0  10  20  20
1  30  40  40

In [8]:
pd.concat([a,b],axis=1) #Two dataFrame is concated,not an intelligence.

    A   B   A   C
0  10  20  10  20
1  30  40  30  40

In [10]:
pd.concat([a,b],axis=1,join='outer') #by default is outer.

    A   B   A   C
0  10  20  10  20
1  30  40  30  40

In [11]:
pd.concat([a,b],axis=1,join='inner')

    A   B   A   C
0  10  20  10  20
1  30  40  30  40

In [12]:
pd.concat([a,b],axis=0,join='outer')  # It will take Union.

    A     B     C
0  10  20.0   NaN
1  30  40.0   NaN
0  10   NaN  20.0
1  30   NaN  40.0

In [13]:
pd.concat([a,b],axis=0,join='inner')  #it will take interSection

    A
0  10
1  30
0  10
1  30

# Merge

In [14]:
pd.concat([a,b])

    A     B     C
0  10  20.0   NaN
1  30  40.0   NaN
0  10   NaN  20.0
1  30   NaN  40.0

In [15]:
a.merge(b) #this is an intelligent function
# takes into account the common columns

    A   B   C
0  10  20  20
1  30  40  40

In [16]:
print(a)
print(b)

    A   B
0  10  20
1  30  40
    A   C
0  10  20
1  30  40

In [17]:
user = pd.DataFrame({'userId':[1,2,3,4],'userName':['Aanand','Sunanda','Kiran','Priya']})

In [18]:
user

   userId userName
0       1   Aanand
1       2  Sunanda
2       3    Kiran
3       4    Priya

In [31]:
skills = pd.DataFrame({'Id':[1,1,2,3],'skills':['Java','TestNG','Playwright','Python']})

In [32]:
skills

   Id      skills
0   1        Java
1   1      TestNG
2   2  Playwright
3   3      Python

In [33]:
# using concat
pd.concat([user,skills])

   userId userName   Id      skills
0     1.0   Aanand  NaN         NaN
1     2.0  Sunanda  NaN         NaN
2     3.0    Kiran  NaN         NaN
3     4.0    Priya  NaN         NaN
0     NaN      NaN  1.0        Java
1     NaN      NaN  1.0      TestNG
2     NaN      NaN  2.0  Playwright
3     NaN      NaN  3.0      Python

In [34]:
pd.concat([user,skills],axis=1)

   userId userName  Id      skills
0       1   Aanand   1        Java
1       2  Sunanda   1      TestNG
2       3    Kiran   2  Playwright
3       4    Priya   3      Python

In [37]:
# using merge
user.merge(skills) #Apply#left_on=left_on,
                   #right_on=right_on,

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

In [38]:
user.merge(skills,left_on='userId',right_on='Id')

   userId userName  Id      skills
0       1   Aanand   1        Java
1       1   Aanand   1      TestNG
2       2  Sunanda   2  Playwright
3       3    Kiran   3      Python

In [39]:
user.merge(skills,left_on='userId', right_on='Id').drop('Id',axis=1) #dropping the duplicate column

   userId userName      skills
0       1   Aanand        Java
1       1   Aanand      TestNG
2       2  Sunanda  Playwright
3       3    Kiran      Python

In [40]:
user

   userId userName
0       1   Aanand
1       2  Sunanda
2       3    Kiran
3       4    Priya

In [41]:
skills

   Id      skills
0   1        Java
1   1      TestNG
2   2  Playwright
3   3      Python

In [44]:
# user merge in skills
skills.merge(user,left_on='Id',right_on='userId')# swapping the tables before merging to check if the data for user 'Priya' is preserved ?

   Id      skills  userId userName
0   1        Java       1   Aanand
1   1      TestNG       1   Aanand
2   2  Playwright       2  Sunanda
3   3      Python       3    Kiran

In [45]:
skills.merge(user,left_on='Id',right_on='userId').drop('Id',axis=1)

       skills  userId userName
0        Java       1   Aanand
1      TestNG       1   Aanand
2  Playwright       2  Sunanda
3      Python       3    Kiran

In [47]:
user.merge(skills,left_on='userId',right_on='Id',how='inner').drop('Id',axis=1)

   userId userName      skills
0       1   Aanand        Java
1       1   Aanand      TestNG
2       2  Sunanda  Playwright
3       3    Kiran      Python

In [48]:
user.merge(skills,left_on='userId',right_on='Id',how='outer').drop('Id',axis=1) #'priya's data is preserved.

   userId userName      skills
0       1   Aanand        Java
1       1   Aanand      TestNG
2       2  Sunanda  Playwright
3       3    Kiran      Python
4       4    Priya         NaN